## 01. Importing Libraries and Create Paths

In [20]:
#Importing libraries
import pandas as pd
import numpy as np
import os

In [21]:
#Path Shortcut
path = r'/Users/puneet/Desktop/Instacart Basket Analysis 08-2025'

In [22]:
#Connect products.csv
df_prods = pd.read_csv(os.path.join(path, '02 Data','Original Data','products.csv'),index_col = False)

In [23]:
#Connect orders_wrangled.csv
df_ords = pd.read_csv(os.path.join(path,'02 Data', 'Prepared Data','orders_wrangled.csv'),index_col = False)

## 02. Data Consistency

In [24]:
#Data check
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

## -

## Mixed-Type Data
    - Column that could contain strings and numeric values

In [25]:
#Creating dataframe
df_test = pd.DataFrame()

In [26]:
#Create a mixed type column
df_test['mix'] = ['a','b',1,True]
#This column has 2 string, 1 numeric, and one boolean value (mixed)

In [27]:
#Check new dataframe
df_test.head()

    mix
0     a
1     b
2     1
3  True

--

In [28]:
#Advanced Python code, this checks for mixed-type columns

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

/var/folders/_t/l5t5ly6n7sng4v9pk5llghjh0000gn/T/ipykernel_24105/4168849639.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

- Code above is using a "for-loop". "for" stands for "for these elements, do this"
- "weird" variable checks if data is consistent. If True, there is inconsistency, if False, then one data type
- Boolean values also represetned by numbers. 0 = False, 1 = True

In [29]:
#This will change 'Mix' column to a string instead of a mixed-type column
df_test['mix'] = df_test['mix'].astype('str')

## -

## Missing Values
    - First find, then fix

In [30]:
#Finding missing/null values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

- isnull() function finds a vlue of true or false, if there is a null value
- .sum() function adds up the number of "True" values

Next step is to find these 16 missing values by creating a new dataframe

In [31]:
#New df_nan dataframe which shows only null value rows
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [32]:
#Check df_nan
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

Address Missing Values
1. Create a new variable that acts like a flag based on missing valuse
2. Impute the value with the means or median of the column(if numeric)
4. Remove or filter out

In [33]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

Filling Column with mean/median values function:
- df['column with missings'].fillna(mean value, inplace = True)
- df['column with missings'].fillna(median value, inplace = True)

Cannot use mean values here because 'product_name' is a string

In [35]:
#Check size of current table, before removing values and comparing
df_prods.shape

(49693, 5)

In [38]:
#New clean dataframe with 16 null rows taken out
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [39]:
#Check new clean dataframe for row count
df_prods_clean.shape

(49677, 5)

- Another drop function
    - df_prods.dropna(inplace = True)
    - df_prods.dropna(subset = [‘product_name’], inplace = True)

This option lets you overwrite, instead of creating a new dataframe

## -

## Duplicates
- Find duplicates first using below function

In [41]:
#Create new 'dups' dataframe to locate duplicates first
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [42]:
#Check new dups dataframe
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

Next step is addressing duplicates
- Dropping duplicates in pandas has a function
- df.drop_duplicates() is the function

In [43]:
#check row count of dataframe before droping duplicates
df_prods_clean.shape

(49677, 5)

In [44]:
#Create new dataframe that doesn't include duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [45]:
#Check row count of de-deuped dataframe
df_prods_clean_no_dups.shape

(49672, 5)

5 fewer rows, which means new dataframe has the de-duped data

## -

## Tidying Up and Exporting Changes

In [46]:
#Export new clean products dataframe as .csv in files
df_prods_clean_no_dups.to_csv(os.path.join(path,'02 Data', 'Prepared Data', 'products_checked.csv'))